files/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
|*---------------------------------------------------------------------------*|
|  File created by CFD support s.r.o.  on   Tue Jan 31 09:30:13 2023          |
|                    http://www.cdfsupport.com                                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    location "0";
    object U;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [0 1 -1 0 0 0 0];

internalField uniform (30 0 0);

boundaryField
{
    ".*_inlet"
    {
        type fixedValue;
        value uniform (30 0 0);
    }
    ".*_outlet"
    {
        type zeroGradient;
    }
    ".*_wall"
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    ".*_slip"
    {
        type slip;
    }
}

// ************************************************************************* //
