files/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\       / F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\     / O peration      | Version:  2.3.0                                 |
|   \\   / A nd             | Web:      www.OpenFOAM.org                      |
|    \\ / M anipulation     |                                                 |
\*-------------------------------------------------------------------------- */
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions [0 2 -3 0 0 0 0];

internalField uniform 0.00052789;

boundaryField
{
    ".*_inlet"
    {
        type fixedValue;
        value uniform 0.00052789;
    }
    ".*_outlet"
    {
        type zeroGradient;
    }
    ".*_wall"
    {
        type epsilonWallFunction;
        value $internalField;
    }
    ".*_slip"
    {
        type slip;
    }
}

// ************************************************************************* //
