files/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
|*---------------------------------------------------------------------------*|
|  File created by CFD support s.r.o.  on   Tue Jan 31 14:53:08 2023          |
|                    http://www.cdfsupport.com                                |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location "system";
    object fvSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    Phi
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-06;
        relTol          0.01;
        minIter         1;
    }
    omega
    {
      solver          smoothSolver;
      smoother        GaussSeidel;
      nSweeps         2;
      tolerance       1e-20;
      relTol          0.1;
    }
    p
    {
        solver GAMG;
        tolerance 1e-6;
        relTol 0.1;
        smoother GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 20;
        agglomerator faceAreaPair;
        mergeLevels 1;
    }
    "(U|k|epsilon)"
    {
        solver smoothSolver;
        smoother GaussSeidel;
        tolerance 1e-5;
        relTol 0.1;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 5;
}

SIMPLE
{
    residualControl
    {
        p               1e-4;
        U               1e-4;
        "(k|omega|epsilon)" 1e-4;
    }
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    fields
    {
        p 0.3;
    }
    equations
    {
        U 0.7;
        k 0.7;
        epsilon 0.7;
        omega 0.7;
    }
}

// ************************************************************************* //
