files/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\       / F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\     / O peration      | Version:  2.3.0                                 |
|   \\   / A nd             | Web:      www.OpenFOAM.org                      |
|    \\ / M anipulation     |                                                 |
\*-------------------------------------------------------------------------- */
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

U
{
    boundaryField
    {
        inlet_inlet
        {
            type	fixedProfile;
            profile	tableFile;
            profileCoeffs	
	    {
	    	file	"UProfile.txt";
	    }
	    direction (0 0 1);
	    origin    0;
        }
    }
}